#+TITLE: GnuPG - Paypal donation summry
#+STARTUP: showall
#+SETUPFILE: "../share/setup.inc"

#+HTML: <!--table_data_wideright-->

*** Paypal separated by currency

 | Year | Mon |   EUR | fee | GBP | fee |  USD | fee |   JPY |  fee |  nEUR | nGBP | nUSD | nJPY |   xUSD |    xGBP |   xJPY | total |
 |------+-----+-------+-----+-----+-----+------+-----+-------+------+-------+------+------+------+--------+---------+--------+-------|
 | 2017 |  01 |   145 |  12 |     |     | 1394 |  73 |   500 |  100 |   133 |    0 | 1228 |    3 | 1.0755 | 0.86105 | 121.94 |  1364 |
 |      |  02 |    85 |   6 |  10 |   1 |  110 |   7 |       |      |    79 |   11 |   97 |    0 | 1.0597 | 0.85305 | 118.83 |   187 |
 |      |  03 |   225 |  13 |     |     |   20 |   1 |       |      |   212 |    0 |   18 |    0 | 1.0691 | 0.85553 | 119.55 |   230 |
 |      |  04 |   139 |   5 |   5 |   0 |   10 |   1 |       |      |   134 |    6 |    8 |    0 |  1.093 | 0.84473 | 121.76 |   148 |
 |      |  05 |    55 |   3 |     |     |   26 |   2 |       |      |    52 |    0 |   21 |    0 | 1.1221 | 0.87365 |  124.4 |    73 |
 |      |  06 | 11140 | 439 | 158 |   9 | 3148 | 161 | 61500 | 3700 | 10701 |  169 | 2617 |  452 | 1.1412 | 0.87933 | 127.75 | 13939 |
 |      |  07 |  4003 | 219 | 255 |  13 | 2838 | 143 | 15000 |  900 |  3784 |  271 | 2298 |  109 | 1.1727 |  0.8942 |  129.7 |  6462 |
 |      |  08 |  1952 | 119 | 120 |   7 | 1413 |  79 |  5000 |  300 |  1833 |  123 | 1128 |   36 | 1.1825 | 0.91973 | 130.81 |  3120 |
 |      |  09 |  2489 | 145 | 150 |   8 |  995 |  59 |       |      |  2344 |  161 |  793 |    0 | 1.1806 | 0.88178 | 132.82 |  3298 |
 |      |  10 |  1699 | 112 |  35 |   3 |  905 |  53 |       |      |  1587 |   36 |  732 |    0 | 1.1638 | 0.87853 |    132 |  2355 |
 |      |  11 |  1585 | 102 |  55 |   3 |  750 |  45 |       |      |  1483 |   59 |  595 |    0 | 1.1849 | 0.87985 | 133.08 |  2137 |
 |      |  12 |  7078 | 335 |  90 |   5 |  926 |  56 |       |      |  6743 |   96 |  725 |    0 | 1.1993 | 0.88723 | 135.01 |  7564 |
 | 2018 |  01 |  1902 | 116 |  36 |   3 |  855 |  50 |       |      |  1786 |   38 |  646 |    0 | 1.2457 |  0.8791 |  135.6 |  2470 |
 |      |  02 |  1493 |  97 |  54 |   3 |  660 |  39 |       |      |  1396 |   58 |  508 |    0 | 1.2214 | 0.88415 | 130.72 |  1962 |
 |      |  03 |  1762 | 110 |  50 |   3 | 2267 | 123 |       |      |  1652 |   54 | 1740 |    0 | 1.2321 |  0.8749 | 131.15 |  3446 |
 |      |  04 |  1763 | 104 |  35 |   2 |  735 |  44 |       |      |  1659 |   38 |  572 |    0 | 1.2079 |  0.8796 | 132.12 |  2269 |
 |      |  05 |  1638 |  98 |  35 |   2 |  797 |  47 |       |      |  1540 |   38 |  641 |    0 | 1.1699 |  0.8768 | 127.33 |  2219 |
 |      |  06 |  2025 | 117 |  65 |   4 |  795 |  46 | 15000 |  820 |  1908 |   69 |  642 |  110 | 1.1658 | 0.88605 | 129.04 |  2729 |
 |      |  07 |  1587 | 104 |  55 |   3 |  705 |  42 |       |      |  1483 |   58 |  567 |    0 | 1.1684 |  0.8907 | 129.79 |  2108 |
 |      |  08 |  1213 |  82 |  39 |   2 |  680 |  40 |  8100 |  460 |  1131 |   41 |  553 |   59 | 1.1571 |  0.8934 | 128.54 |  1784 |
 |      |  09 |  1841 | 119 |  50 |   3 |  790 |  52 |       |      |  1722 |   53 |  638 |    0 | 1.1576 |  0.8873 | 131.23 |  2413 |
 |      |  10 |  6308 | 319 |  40 |   3 |  680 |  45 |       |      |  5989 |   42 |  561 |    0 | 1.1318 | 0.88873 | 128.15 |  6592 |
 |      |  11 |  1063 |  79 |  85 |   5 |  730 |  47 |       |      |   984 |   90 |  601 |    0 | 1.1359 | 0.89068 | 128.99 |  1675 |
 |      |  12 |  1562 | 102 |  50 |   3 |  675 |  44 |       |      |  1460 |   53 |  551 |    0 |  1.145 | 0.89453 | 125.85 |  2064 |
 | 2019 |  01 |  1278 |  90 |  35 |   2 |  710 |  46 |       |      |  1188 |   38 |  578 |    0 | 1.1488 | 0.87578 | 124.81 |  1804 |
 |      |  02 |   958 |  68 |  35 |   2 | 1942 | 117 |       |      |   890 |   38 | 1599 |    0 | 1.1416 | 0.85835 | 126.44 |  2527 |
 |      |  03 |  1401 |  95 |  55 |   4 |  731 |  47 |       |      |  1306 |   59 |  609 |    0 | 1.1235 |  0.8583 | 124.45 |  1974 |
 |      |  04 |  1318 |  86 |  45 |   3 |  680 |  44 |       |      |  1232 |   49 |  567 |    0 | 1.1218 | 0.86248 | 124.93 |  1848 |
 |      |  05 |  1153 |  74 |  35 |   2 |  637 |  41 |       |      |  1079 |   37 |  534 |    0 | 1.1151 | 0.88693 | 121.27 |  1650 |
 |      |  06 |  1453 |  97 |  70 |   4 |  695 |  44 |       |      |  1356 |   74 |  572 |    0 |  1.138 | 0.89655 |  122.6 |  2002 |
 |      |  07 |  1393 |  96 |  35 |   2 |  565 |  37 |       |      |  1297 |   36 |  474 |    0 | 1.1151 | 0.91623 | 121.04 |  1807 |
 |      |  08 |   978 |  68 |  40 |   3 |  725 |  46 |       |      |   910 |   41 |  615 |    0 | 1.1036 | 0.90565 | 117.28 |  1566 |
 |      |  09 |  1327 |  90 |  50 |   3 |  560 |  36 |       |      |  1237 |   53 |  481 |    0 | 1.0889 | 0.88573 | 117.59 |  1771 |
 |      |  10 |  1030 |  74 |  35 |   2 |  630 |  41 |       |      |   956 |   38 |  528 |    0 | 1.1154 | 0.86133 | 120.73 |  1522 |
 |      |  11 |   946 |  66 | 120 |   7 |  591 |  37 |       |      |   880 |  133 |  504 |    0 | 1.0982 | 0.85225 | 120.43 |  1517 |
 |      |  12 |  6377 | 315 |  50 |   3 |  760 |  46 |       |      |  6062 |   55 |  636 |    0 | 1.1234 |  0.8508 | 121.94 |  6753 |
 | 2020 |  01 |  1012 |  72 |  35 |   2 |  665 |  41 |   500 |   69 |   940 |   39 |  565 |    4 | 1.1052 | 0.84175 | 120.35 |  1548 |
 |      |  02 |  2309 |  95 |  35 |   2 |  660 |  41 |       |      |  2214 |   39 |  564 |    0 | 1.0977 | 0.85315 | 119.36 |  2817 |
 |      |  03 |  1122 |  75 |  44 |   3 |  545 |  35 |       |      |  1047 |   46 |  465 |    0 | 1.0956 | 0.88643 |  118.9 |  1558 |
 |      |  04 |   971 |   6 |  35 |   2 | 1877 | 113 |       |      |   965 |   38 | 1622 |    0 | 1.0876 | 0.86905 | 115.87 |  2625 |
 |      |  05 |   792 |  59 |  35 |   2 |  560 |  36 |       |      |   733 |   37 |  471 |    0 | 1.1136 | 0.90088 | 119.29 |  1241 |
 |      |  06 |  1354 |  85 |  60 |   4 |  620 |  40 |       |      |  1269 |   61 |  518 |    0 | 1.1198 | 0.91243 | 120.66 |  1848 |
 |      |  07 |  1227 |  82 |  45 |   3 |  495 |  33 |       |      |  1145 |   47 |  390 |    0 | 1.1848 | 0.90053 | 124.31 |  1582 |
 |      |  08 |   839 |  58 |  35 |   2 |  460 |  31 |       |      |   781 |   37 |  359 |    0 |  1.194 | 0.89605 | 126.47 |  1177 |
 |      |  09 |  1218 |  78 |  50 |   3 |  470 |  31 |       |      |  1140 |   52 |  375 |    0 | 1.1708 | 0.91235 | 123.76 |  1567 |
 |      |  10 |       |     |     |     |      |     |       |      |     0 |    0 |    0 |    0 |        |         |        |     0 |
 |      |  11 |       |     |     |     |      |     |       |      |     0 |    0 |    0 |    0 |        |         |        |     0 |
 |      |  12 |       |     |     |     |      |     |       |      |     0 |    0 |    0 |    0 |        |         |        |     0 |
 #+TBLFM: $11=$3-$4::$12=($5-$6)/$16;%.0f::$13=($7-$8)/$15;%.0f::$14=($9-$10)/$17;%.0f::$18=$11+$12+$13+$14

#+HTML: <div id="smallnote">
/nEUR/, /nGBP/, /nUSD/ and /nJPY/ are the net donations converted to
Euro using the exchange rate from the last banking day of the month
(/xUSD/,/xGBP/, /xJPL/ columns).  Actually received values may differ
because the conversion to Euro is triggered manually as needed.
Values are rounded to a full Euro, USD, Pound or to 100 Yen.
#+HTML: </div>


*** Exchange rates

Taken from the ZIP file found at [[https://www.ecb.europa.eu/stats/policy_and_exchange_rates/euro_reference_exchange_rates/html/index.en.html][ECB page]].

| Date        |    USD |     GBP |    JPY |
|-------------+--------+---------+--------|
| 2017-Jan-31 | 1.0755 | 0.86105 | 121.94 |
| 2017-Feb-28 | 1.0597 | 0.85305 | 118.83 |
| 2017-Mar-31 | 1.0691 | 0.85553 | 119.55 |
| 2017-Apr-28 |  1.093 | 0.84473 | 121.76 |
| 2017-May-31 | 1.1221 | 0.87365 |  124.4 |
| 2017-Jun-30 | 1.1412 | 0.87933 | 127.75 |
| 2017-Jul-31 | 1.1727 |  0.8942 |  129.7 |
| 2017-Aug-31 | 1.1825 | 0.91973 | 130.81 |
| 2017-Sep-29 | 1.1806 | 0.88178 | 132.82 |
| 2017-Oct-31 | 1.1638 | 0.87853 |    132 |
| 2017-Nov-30 | 1.1849 | 0.87985 | 133.08 |
| 2017-Dec-29 | 1.1993 | 0.88723 | 135.01 |
| 2018-Jan-31 | 1.2457 |  0.8791 |  135.6 |
| 2018-Feb-28 | 1.2214 | 0.88415 | 130.72 |
| 2018-Mar-29 | 1.2321 |  0.8749 | 131.15 |
| 2018-Apr-30 | 1.2079 |  0.8796 | 132.12 |
| 2018-May-31 | 1.1699 |  0.8768 | 127.33 |
| 2018-Jun-29 | 1.1658 | 0.88605 | 129.04 |
| 2018-Jul-30 | 1.1684 |  0.8907 | 129.79 |
| 2018-Aug-31 | 1.1651 |  0.8974 | 129.05 |
| 2018-Sep-28 | 1.1576 |  0.8873 | 131.23 |
| 2018-Oct-31 | 1.1318 | 0.88873 | 128.15 |
| 2018-Nov-30 | 1.1359 | 0.89068 | 128.99 |
| 2018-Dec-31 |  1.145 | 0.89453 | 125.85 |
| 2019-Jan-31 | 1.1488 | 0.87578 | 124.81 |
| 2019-Feb-28 | 1.1416 | 0.85835 | 126.44 |
| 2019-Mar-29 | 1.1235 |  0.8583 | 124.45 |
| 2019-Apr-30 | 1.1218 | 0.86248 | 124.93 |
| 2019-May-31 | 1.1151 | 0.88693 | 121.27 |
| 2019-Jun-28 |  1.138 | 0.89655 |  122.6 |
| 2019-Jul-31 | 1.1151 | 0.91623 | 121.04 |
| 2019-Aug-30 | 1.1036 | 0.90565 | 117.28 |
| 2019-Sep-30 | 1.0889 | 0.88573 | 117.59 |
| 2019-Oct-31 | 1.1154 | 0.86133 | 120.73 |
| 2019-Nov-29 | 1.0982 | 0.85225 | 120.43 |
| 2019-Dec-31 | 1.1234 |  0.8508 | 121.94 |
| 2020-Jan-31 | 1.1052 | 0.84175 | 120.35 |
| 2020-Feb-28 | 1.0977 | 0.85315 | 119.36 |
| 2020-Mar-31 | 1.0956 | 0.88643 |  118.9 |
| 2020-Apr-30 | 1.0876 | 0.86905 | 115.87 |
| 2020-May-29 | 1.1136 | 0.90088 | 119.29 |
| 2020-Jun-30 | 1.1198 | 0.91243 | 120.66 |
| 2020-Jul-31 | 1.1848 | 0.90053 | 124.31 |
| 2020-Aug-31 |  1.194 | 0.89605 | 126.47 |
| 2020-Sep-30 | 1.1708 | 0.91235 | 123.76 |
| 2020-Oct-31 |        |         |        |
| 2020-Nov-29 |        |         |        |
| 2020-Dec-31 |        |         |        |
